app/controllers/intervals_controller.rb

SELECT * FROM `intervals` WHERE (`intervals`.`id` = 1)
---
  def show
    @interval = Interval.find(params[:id])

SELECT * FROM `intervals` WHERE (`intervals`.`id` = 1)
---
  def edit
    @interval = Interval.find(params[:id])

INSERT INTO `intervals` (`final_time`, `updated_at`, `project`, `start_time`, `end_time`, `created_at`) VALUES(NULL, '2009-06-18 04:31:30', 'Project Timer:Testing', '2009-06-17 22:37:00', '2009-06-18 04:27:00', '2009-06-18 04:31:30')
---
  def create
    @interval = Interval.new(params[:interval])

    respond_to do |format|
      if @interval.save

SELECT * FROM `intervals` WHERE (`intervals`.`id` = 1)
UPDATE `intervals` SET `start_time` = '2009-06-17 22:23:00', `end_time` = '2009-06-18 22:32:00', `updated_at` = '2009-06-18 04:32:35' WHERE `id` = 1
---
  def update
    @interval = Interval.find(params[:id])

    respond_to do |format|
      if @interval.update_attributes(params[:interval])